КАКерамика_моя_старая_база/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикация</name>
    <type>
      <types>EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетХранилищеВариантов</name>
    <comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов &quot;ХранилищеВариантовОтчетов&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТеснаяИнтеграцияСФормойОтчета</name>
    <comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой &quot;ФормаОтчета&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимостиРазрешений</name>
    <type>
      <types>EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗапуска</name>
      <type>
        <types>EnumRef.СпособыВызоваДополнительныхОбработок</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьОповещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегламентноеЗаданиеGUID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемыеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ОбъектНазначения</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>ВидРазрешения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_РежимРасширенияСервер/Module.bsl
#Область ОбработкаЗапускаРегламентныхЗаданий

Функция ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Экспорт
	
	ЕстьМетаданные = Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено
					И Метаданные.ФункциональныеОпции.Найти("ИспользоватьДополнительныеОтчетыИОбработки") <> Неопределено
					И Метаданные.Справочники["ДополнительныеОтчетыИОбработки"].ТабличныеЧасти.Найти("Команды") <> Неопределено
					И Метаданные.Перечисления.Найти("ВариантыПубликацииДополнительныхОтчетовИОбработок") <> Неопределено
					И Метаданные.Перечисления.Найти("ВидыДополнительныхОтчетовИОбработок") <> Неопределено
					И Метаданные.Перечисления.Найти("СпособыВызоваДополнительныхОбработок") <> Неопределено;
		
	Возврат ЕстьМетаданные;
	
КонецФункции

Процедура ОбработкаЗапускаРегламентныхЗаданий_ДобавитьНовые() Экспорт
	
	Если Не ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаСправочника = ОбработкаЗапускаРегламентныхЗаданий_Ссылка();
	Если Не ЗначениеЗаполнено(СсылкаСправочника) Тогда
		Сообщить("Не удалось найти обработку: " + ОбработкаЗапускаРегламентныхЗаданий_Наименование());
		Сообщить("Подключите ее через обработку: Фоновые и регламентные задания");
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		Сведения = ОбработкаЗапускаРегламентныхЗаданий_СведенияОВнешнейОбработке();
		ТабРасписаний = ОбработкаЗапускаРегламентныхЗаданий_РасписанияИзМакета();
		
		Для Каждого СтрокаСведенийКоманд Из Сведения.Команды Цикл
			
			Если ОбъектСправочника.Команды.Найти(СтрокаСведенийКоманд.Идентификатор, "Идентификатор") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаКоманды = ОбъектСправочника.Команды.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКоманды, СтрокаСведенийКоманд);
			СтрокаКоманды.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
			
			НовоеРегламентное = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			НовоеРегламентное.Использование = Ложь;
			
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодНедель = 1;
			
			НайденнаяСтрока = ТабРасписаний.Найти(СтрокаКоманды.Идентификатор, "ИдентификаторКоманды");
			Если Не НайденнаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Расписание, НайденнаяСтрока, "ПериодПовтораВТечениеДня,ПаузаПовтора,ИнтервалЗавершения");
				НовоеРегламентное.Использование = НайденнаяСтрока.Использование;
			КонецЕсли;
			
			НовоеРегламентное.Параметры.Добавить(СсылкаСправочника);
			НовоеРегламентное.Параметры.Добавить(СтрокаКоманды.Идентификатор);
			НовоеРегламентное.Наименование = СтрокаКоманды.Представление;
			НовоеРегламентное.Расписание = Расписание;
			НовоеРегламентное.Записать();
			
			СтрокаКоманды.РегламентноеЗаданиеGUID = НовоеРегламентное.УникальныйИдентификатор;
			
		КонецЦикла;
		
		ОбъектСправочника.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработкаЗапускаРегламентныхЗаданий_ЗаменитьРЗ(СтарыйИдентификатор, НовыйИдентификатор) Экспорт
	
	Если Не ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаСправочника = ОбработкаЗапускаРегламентныхЗаданий_Ссылка();
	Если Не ЗначениеЗаполнено(СсылкаСправочника) Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		
		// Найдем старую команду
		СтараяКоманда = ОбъектСправочника.Команды.Найти(СтарыйИдентификатор, "Идентификатор");
		Если СтараяКоманда = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СведенияОВнешнейОбработке = ОбработкаЗапускаРегламентныхЗаданий_СведенияОВнешнейОбработке();
		НоваяКоманда = СведенияОВнешнейОбработке.Команды.Найти(НовыйИдентификатор, "Идентификатор");
		Если НоваяКоманда = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Заменим идентификатор и представление команды обработки
		СтараяКоманда.Идентификатор = НовыйИдентификатор;
		СтараяКоманда.Представление = НоваяКоманда.Представление;
		
		// Обновим представление РЗ
		НайденноеРЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(СтараяКоманда.РегламентноеЗаданиеGUID));
		Если НайденноеРЗ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НайденноеРЗ.Наименование = НоваяКоманда.Представление;
		НайденноеРЗ.Параметры.Очистить();
		НайденноеРЗ.Параметры.Добавить(СсылкаСправочника);
		НайденноеРЗ.Параметры.Добавить(НовыйИдентификатор);
		НайденноеРЗ.Записать();
		
		// Запишем обработку
		ОбъектСправочника.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработкаЗапускаРегламентныхЗаданий_Подключить() Экспорт
	
	Если Не ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
	Шаблон = ПолучитьОбщийМакет("КонтурЛогистика_ДополнительнаяОбработкаРегламентныеДляРасширенияШаблон");
	Шаблон.Записать(ИмяВременногоФайла);
	ДвоичныеДанныеОбработки = Новый ДвоичныеДанные(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	
	ТабРасписаний = ОбработкаЗапускаРегламентныхЗаданий_РасписанияИзМакета();
	
	СсылкаСправочника = ОбработкаЗапускаРегламентныхЗаданий_Ссылка();
	Если Не ЗначениеЗаполнено(СсылкаСправочника) Тогда
		ОбъектСправочника = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		
		СсылкаСправочника = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ОбъектСправочника.УстановитьСсылкуНового(СсылкаСправочника);		
	Иначе
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
	КонецЕсли;           
	
	Сведения = ОбработкаЗапускаРегламентныхЗаданий_СведенияОВнешнейОбработке();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ОбъектСправочника.Наименование = Сведения.Наименование;
		ОбъектСправочника.БезопасныйРежим 	= Сведения.БезопасныйРежим;
		ОбъектСправочника.Версия 			= Сведения.Версия;
		ОбъектСправочника.Вид 				= Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
		ОбъектСправочника.ИмяОбъекта		= "РегламентыеДляРасширенияКонтурЛогистика";
		ОбъектСправочника.ИмяФайла 			= "Регламентные задания для расширения Контур.Логистика.epf";
		ОбъектСправочника.Информация 		= Сведения.Информация;
		ОбъектСправочника.Комментарий		= "См. вкладку Дополнительная информация";
		ОбъектСправочника.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
		ОбъектСправочника.Публикация 		= Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		ОбъектСправочника.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки, Новый СжатиеДанных(9));
		
		Для Каждого СтрокаСведенийКоманд Из Сведения.Команды Цикл
			
			Если ОбъектСправочника.Команды.Найти(СтрокаСведенийКоманд.Идентификатор, "Идентификатор") = Неопределено Тогда
				
				СтрокаКоманды = ОбъектСправочника.Команды.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаКоманды, СтрокаСведенийКоманд);
				СтрокаКоманды.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
				
				НовоеРегламентное = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
				НовоеРегламентное.Использование = Ложь;
					
				Расписание = Новый РасписаниеРегламентногоЗадания;
				Расписание.ПериодПовтораДней 		= 1;
				Расписание.ПериодНедель 			= 1;
					
				НайденнаяСтрока = ТабРасписаний.Найти(СтрокаКоманды.Идентификатор, "ИдентификаторКоманды");
				Если НЕ НайденнаяСтрока = Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Расписание, НайденнаяСтрока, "ПериодПовтораВТечениеДня,ПаузаПовтора,ИнтервалЗавершения");
					НовоеРегламентное.Использование = НайденнаяСтрока.Использование;
				КонецЕсли;

				НовоеРегламентное.Параметры.Добавить(СсылкаСправочника);
				НовоеРегламентное.Параметры.Добавить(СтрокаКоманды.Идентификатор);
				НовоеРегламентное.Наименование = СтрокаКоманды.Представление;
				НовоеРегламентное.Расписание = Расписание;
				НовоеРегламентное.Записать();
					
				СтрокаКоманды.РегламентноеЗаданиеGUID = НовоеРегламентное.УникальныйИдентификатор;

			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектСправочника.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение 
		
		ОтменитьТранзакцию();
		КонтурЛогистика_Метрика.ОбработатьОшибку("ОбработкаЗапускаРегламентныхЗаданий_Подключить", ОписаниеОшибки());
		
	КонецПопытки
	
КонецПроцедуры

Функция ОбработкаЗапускаРегламентныхЗаданий_СведенияОВнешнейОбработке() Экспорт
	
	Информация = "Обработка является служебной и используется для работы с регламентными заданиями Контур.Логистика."
		+ Символы.ПС + "ВНИМАНИЕ! Не рекомендуется записывать/перезаписывать этот элемент справочника дополнительных обработок!"
		+ Символы.ПС + "Для включения/выключения заданий, а также изменений расписания воспользуйтесь формой Сервис - Фоновые и регламентные задания меню подсистемы Контур.Логистика."
		+ Символы.ПС + "В противном случае, при записи данного элемента все отключенные регламентные задания будут удалены.";
		
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Версия", "1.0");    
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", ОбработкаЗапускаРегламентныхЗаданий_Наименование());
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", Информация);
	ПараметрыРегистрации.Вставить("ВерсияБСП", "");
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	РеквизитыТабличнойЧасти = Метаданные.Справочники.ДополнительныеОтчетыИОбработки.ТабличныеЧасти.Команды.Реквизиты;
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); // ОткрытиеФормы, ВызовКлиентскогоМетода, ВызовСерверногоМетода
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
	ОбработкаЗапускаРегламентныхЗаданий_ЗаполнитьТаблицу(ТаблицаКоманд);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции        

Процедура ОбработкаЗапускаРегламентныхЗаданий_ЗаполнитьТаблицу(ТаблицаКоманд)
	
	ТаблицаКоманд.Очистить();
	
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ОчисткаУстаревшихДанных", 					"Очистка устаревших данных (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ОчисткаПросроченныхУИДовГИС",				"Очистка просроченных УИДов ГИС (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ЗагрузкаСобытийИВходящихДокументов", 		"Загрузка входящих событий и документов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ОтправитьГотовыеКОтправкеДокументы", 		"Отправка готовых к отправке документов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ЗапускРоботов",							"Запуск роботов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ПланировщикЗапускаРоботов",				"Планировщик запуска роботов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов",	"Авто получение и отправка QR-кодов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_АвтоматическаяОтправкаВТелеграм",			"Автоматическая отправка в Телеграм (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ПоискСозданиеСвязанныхДокументов",			"Поиск и создание связанных документов (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ОтправкаМетрик",							"Отправка метрик (Контур.Логистика)");
	ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, "КонтурЛогистика_ОтправкаОбработкаПроизвольныхДанных",		"Отправка обработка произвольных данных (Контур.Логистика)");
	
КонецПроцедуры

Процедура ОбработкаЗапускаРегламентныхЗаданий_ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	
	Если ИдентификаторКоманды = "КонтурЛогистика_ОчисткаУстаревшихДанных" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ОчисткаУстаревшихДанных();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ОчисткаПросроченныхУИДовГИС" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ОчисткаПросроченныхУИДовГИС();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ЗагрузкаСобытийИВходящихДокументов" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ЗагрузкаСобытийИВходящихДокументов();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ОтправитьГотовыеКОтправкеДокументы" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ОтправитьГотовыеКОтправкеДокументы();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ЗапускРоботов" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ЗапускРоботов();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ПланировщикЗапускаРоботов" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ПланировщикЗапускаРоботов();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_АвтоматическаяОтправкаВТелеграм" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_АвтоматическаяОтправкаВТелеграм();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ПоискСозданиеСвязанныхДокументов" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ПоискСозданиеСвязанныхДокументов();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ОтправкаМетрик" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ОтправкаМетрик();
		
	ИначеЕсли ИдентификаторКоманды = "КонтурЛогистика_ОтправкаОбработкаПроизвольныхДанных" Тогда
		КонтурЛогистика_РегламентныеЗадания.КонтурЛогистика_ОтправкаОбработкаПроизвольныхДанных();
		
	Иначе
		ВызватьИсключение "Неизвестный идентификатор команды для регламентного задания";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗапускаРегламентныхЗаданий_ДобавитьВТаблицу(ТаблицаКоманд, Идентификатор, Представление)

	СтрокаТЧ = ТаблицаКоманд.Добавить();
	СтрокаТЧ.Идентификатор = Идентификатор;
	СтрокаТЧ.Представление = Представление;
	СтрокаТЧ.ПоказыватьОповещение = Ложь;
	СтрокаТЧ.Использование = "ВызовСерверногоМетода";
	
КонецПроцедуры

Функция ОбработкаЗапускаРегламентныхЗаданий_Наименование() 
	
	Возврат "Регламентные задания для расширения Контур.Логистика";
	
КонецФункции   

Функция ОбработкаЗапускаРегламентныхЗаданий_Ссылка() Экспорт 
	
	Если Не ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДопОбработки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИОбработки КАК ДопОбработки
	               |ГДЕ
	               |	НЕ ДопОбработки.ПометкаУдаления
	               |	И ДопОбработки.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ОбработкаЗапускаРегламентныхЗаданий_Наименование());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	
КонецФункции

Функция ОбработкаЗапускаРегламентныхЗаданий_РасписанияИзМакета()
	
	Макет = ПолучитьОбщийМакет("КонтурЛогистика_РасписанияРегламентныхДляРасширения");
	
	ТабРасписаний = Новый ТаблицаЗначений;
	
	ТабРасписаний.Колонки.Добавить("ИдентификаторКоманды", 		Новый ОписаниеТипов("Строка"));
	ТабРасписаний.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Число"));
	ТабРасписаний.Колонки.Добавить("ПериодПовтораВТечениеДня", 	Новый ОписаниеТипов("Число"));
	ТабРасписаний.Колонки.Добавить("ПаузаПовтора", 				Новый ОписаниеТипов("Число"));
	ТабРасписаний.Колонки.Добавить("ИнтервалЗавершения", 		Новый ОписаниеТипов("Число"));
	
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл
		
		СтрРасписания = ТабРасписаний.Добавить();
		СтрРасписания.ИдентификаторКоманды 			= Макет.Область(Сч, 1).Текст;
		СтрРасписания.Использование 				= Макет.Область(Сч, 2).Текст;
		СтрРасписания.ПериодПовтораВТечениеДня 		= Макет.Область(Сч, 3).Текст;
		СтрРасписания.ПаузаПовтора					= Макет.Область(Сч, 4).Текст;
		СтрРасписания.ИнтервалЗавершения 			= Макет.Область(Сч, 5).Текст;
		
	КонецЦикла;
	
	Возврат ТабРасписаний;

КонецФункции

Функция ИмяОбработкиРегламентныхЗаданийДляРасширенияКонтурЛогистика() Экспорт
	
	Возврат "РегламентыеДляРасширенияКонтурЛогистика";
	
КонецФункции

Функция ДобавитьРегламентноеЗадание(Параметры) Экспорт
	
	МетаданныеЗадания = Параметры.Метаданные;
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);
	
	Если Параметры.Свойство("Наименование") Тогда
		Задание.Наименование = Параметры.Наименование;
	Иначе
		Задание.Наименование = МетаданныеЗадания.Наименование;
	КонецЕсли;
	
	Если Параметры.Свойство("Использование") Тогда
		Задание.Использование = Параметры.Использование;
	Иначе
		Задание.Использование = МетаданныеЗадания.Использование;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		Задание.Ключ = Параметры.Ключ;
	Иначе
		Задание.Ключ = МетаданныеЗадания.Ключ;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяПользователя") Тогда
		Задание.ИмяПользователя = Параметры.ИмяПользователя;
	КонецЕсли;
	
	Если Параметры.Свойство("ИнтервалПовтораПриАварийномЗавершении") Тогда
		Задание.ИнтервалПовтораПриАварийномЗавершении = Параметры.ИнтервалПовтораПриАварийномЗавершении;
	Иначе
		Задание.ИнтервалПовтораПриАварийномЗавершении = МетаданныеЗадания.ИнтервалПовтораПриАварийномЗавершении;
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоПовторовПриАварийномЗавершении") Тогда
		Задание.КоличествоПовторовПриАварийномЗавершении = Параметры.КоличествоПовторовПриАварийномЗавершении;
	Иначе
		Задание.КоличествоПовторовПриАварийномЗавершении = МетаданныеЗадания.КоличествоПовторовПриАварийномЗавершении;
	КонецЕсли;
	
	Если Параметры.Свойство("Параметры") Тогда
		Задание.Параметры = Параметры.Параметры;
	КонецЕсли;
	
	Если Параметры.Свойство("Расписание") Тогда
		Задание.Расписание = Параметры.Расписание;
	КонецЕсли;
	
	Задание.Записать();
	
	Возврат Задание;
	
КонецФункции

#КонецОбласти
